#+title: Deploying OSMR
#+subtitle: runs pretty fast locally
#+tags[]: openstreetmap routing docker osmr
#+date: 2024-03-16T18:21:01

I'm working on a routing service, and been playing around with
different projects based off of the [[https://www.openstreetmap.org/about][OpenStreetMap]] project.

Here's what I went through to deploy the [[https://project-osrm.org/][OpenSourceRoutingMachine]]
project locally.

#+begin_src bash
  docker volume create map_data
#+end_src

We'll startup a container that has that volume mounted it in, and then
download the data from the internet and process it as needed.

* Run the server

#+begin_src bash
  docker run -it \
         -p 5000:5000 \
         -v map_data:/data \
         ghcr.io/project-osrm/osrm-backend osrm-routed \
         --algorithm mld \
         /data/north-america-latest.osrm
#+end_src

Once that gets going, we can hit it locally and pass the results
through =jq=:

#+begin_src bash :results output
  curl "http://127.0.0.1:5000/route/v1/driving/-73.364755,41.838942;-73.409656,41.752237?steps=true" \
      | jq -r '.routes | .[] | .legs | .[] | .steps | .[] | .name'
#+end_src

#+RESULTS:
#+begin_example
Popple Swamp Road
River Road South
Kent Road South
Warren Hill Road
Cornwall Road
Kent Road
Segar Mountain Road
Kenico Road
Gorham Road
Old Homestead Lane
Stonewall Lane


#+end_example

